Autodesk.Revit.DB.NavisworksExportScope
Since:
2014
An enumerated type listing possible "Element Scopes" of Navisworks Exporter.
Since:
2014

Autodesk.Revit.DB.NavisworksExportScope.SelectedElements
Export the selected elements.

Autodesk.Revit.DB.NavisworksExportScope.View
Export the elements in a view.

Autodesk.Revit.DB.NavisworksExportScope.Model
Export all elements in the document.